{
  "projects": {
    "title": "Projects",
    "subtitle": "These are some of my projects that showcase my skills and experience. I am always looking for new challenges and opportunities to continue growing as a developer.",
    "data": [
      {
        "title": "Personal Portfolio",
        "description": "Personal portfolio built with React and TypeScript, featuring a modern and responsive design using Tailwind CSS, smooth SPA navigation, a skills section, and interactive elements.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/SlatPortafolio",
        "demo": "#"
      },
      {
        "title": "JapanOffline",
        "description": "Offline-friendly travel guide for Japan. Includes useful phrases, transport info, cultural tips and essential resources, with a downloadable PDF for full access without internet.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/JapanOffline",
        "demo": "https://japon-offline.netlify.app/"
      },
      {
        "title": "JohanShop",
        "description": "Practice web application for managing an online store. Includes a product catalog, shopping cart, and a basic administration system. Built with React and TypeScript, using Tailwind CSS for a modern, responsive, and user-friendly design.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/JohanShop",
        "demo": ""
      },
      {
        "title": "AdaptaMaterialEscolar 2.0",
        "description": "Interactive web tool developed as a Final Degree Project at UCM. Allows customization and adaptation of school materials in an accessible, modular, and collaborative way. Includes an advanced text editor with Slate.js, PDF export, and visual resource management through pictograms. Designed with an inclusive approach and built in React.",
        "image": "",
        "stack": [
          "React",
          "JavaScript",
          "Slate.js",
          "Node.js",
          "CSS3",
          "Figma",
          "Netlify"
        ],
        "github": "https://github.com/dnet0/TFG-22-23-AdaptaMaterialEscolar2.0",
        "demo": "https://adme2.netlify.app/"
      },
      {
        "title": "BankHelp",
        "description": "Banking simulator built with hexagonal architecture and tactical DDD. Features clear use cases, JWT security, decoupled repositories and integration tests with Testcontainers.",
        "image": "",
        "stack": [
          "Java 17",
          "Spring Boot 4",
          "Hexagonal Architecture",
          "Tactical DDD",
          "Spring Security",
          "JWT",
          "PostgreSQL",
          "Testcontainers"
        ],
        "github": "https://github.com/dnet0/bankhelp",
        "demo": ""
      }
    ]
  }
}