{
  "projects": {
    "title": "Projects",
    "subtitle": "These are some of my projects that showcase my skills and experience. I am always looking for new challenges and opportunities to continue growing as a developer.",
    "data": [
      {
        "title": "Personal Portfolio",
        "description": "Personal portfolio built with React and TypeScript, featuring a modern and responsive design using Tailwind CSS, smooth SPA navigation, a skills section, and interactive elements.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/SlatPortafolio",
        "demo": "#"
      },
      {
        "title": "JapanOffline",
        "description": "This website was created with a very clear goal: to help you navigate Japan even when you don't have an internet connection. Here you will find useful phrases, transportation information, culture, directions, emergency numbers, and much more. Everything is designed so you can download the guide as a PDF 📄 and always carry it with you, whether on your phone, tablet, or printed. That way, even without data or Wi-Fi, you'll have a survival manual ready to help you out.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/JapanOffline",
        "demo": "https://slatportafolio.netlify.app/"
      },
      {
        "title": "JohanShop",
        "description": "Practice web application for managing an online store. Includes a product catalog, shopping cart, and a basic administration system. Built with React and TypeScript, using Tailwind CSS for a modern, responsive, and user-friendly design.",
        "image": "",
        "stack": [
          "React",
          "TypeScript",
          "Tailwind",
          "esLint",
          "Vite"
        ],
        "github": "https://github.com/dnet0/JohanShop",
        "demo": ""
      },
      {
        "title": "AdaptaMaterialEscolar 2.0",
        "description": "Interactive web tool developed as a Final Degree Project at UCM. Allows customization and adaptation of school materials in an accessible, modular, and collaborative way. Includes an advanced text editor with Slate.js, PDF export, and visual resource management through pictograms. Designed with an inclusive approach and built in React.",
        "image": "",
        "stack": [
          "React",
          "JavaScript",
          "Slate.js",
          "Node.js",
          "CSS3",
          "Figma",
          "Netlify"
        ],
        "github": "https://github.com/dnet0/TFG-22-23-AdaptaMaterialEscolar2.0",
        "demo": "https://adme2.netlify.app/"
      }
    ]
  }
}
