[
  {
    "title": "Portfolio Personal",
    "description": "Portafolio personal construido con React y TypeScript, con dise침o moderno y responsive usando Tailwind CSS, navegaci칩n SPA fluida, secci칩n de habilidades y elementos interactivos.",
    "image": "",
    "stack": [
      "React",
      "TypeScript",
      "Tailwind",
      "esLint",
      "Vite"
    ],
    "github": "https://github.com/dnet0/SlatPortafolio",
    "demo": "#"
  },
  {
    "title": "JapanOffline",
    "description": "Esta web ha sido creada con un objetivo muy claro: ayudarte a desenvolverte en Jap칩n incluso cuando no tengas conexi칩n a internet. Aqu칤 encontrar치s frases 칰tiles, informaci칩n de transporte, cultura, direcciones, n칰meros de emergencia y mucho m치s. Todo est치 pensado para que puedas descargar la gu칤a en PDF 游늯 y llevarla siempre contigo, ya sea en el m칩vil, la tablet o impresa en papel. De esta forma, aunque te quedes sin datos o Wi-Fi, tendr치s un manual de supervivencia listo para sacarte de apuros.",
    "image": "",
    "stack": [
      "React",
      "TypeScript",
      "Tailwind",
      "esLint",
      "Vite"
    ],
    "github": "https://github.com/dnet0/JapanOffline",
    "demo": "https://slatportafolio.netlify.app/"
  },
  {
    "title": "JohanShop",
    "description": "Aplicaci칩n web de pr치ctica para la gesti칩n de una tienda online. Incluye cat치logo de productos, carrito de compras y sistema b치sico de administraci칩n. Construido con React y TypeScript, usando Tailwind CSS para un dise침o moderno, responsive y f치cil de usar.",
    "image": "",
    "stack": [
      "React",
      "TypeScript",
      "Tailwind",
      "esLint",
      "Vite"
    ],
    "github": "https://github.com/dnet0/JohanShop",
    "demo": ""
  },
  {
    "title": "AdaptaMaterialEscolar 2.0",
    "description": "Herramienta web interactiva desarrollada como Trabajo de Fin de Grado en la UCM. Permite personalizar y adaptar material escolar de forma accesible, modular y colaborativa. Incluye un editor de texto avanzado con Slate.js, exportaci칩n a PDF y gesti칩n visual de recursos mediante pictogramas. Dise침ada con enfoque inclusivo y construida en React.",
    "image": "",
    "stack": [
      "React",
      "JavaScript",
      "Slate.js",
      "Node.js",
      "CSS3",
      "Figma",
      "Netlify"
    ],
    "github": "https://github.com/dnet0/TFG-22-23-AdaptaMaterialEscolar2.0",
    "demo": "https://adme2.netlify.app/"
  }
]